---
title: StructuralElementDefinitionData
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# StructuralElementDefinitionData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Curve CenterCurve { get; }` | `structuralElementDefinitionData.CenterCurve` | Curve |
| `Curve Curve { get; }` | `structuralElementDefinitionData.Curve` | Curve |
| `Double EndShortening { get; }` | `structuralElementDefinitionData.EndShortening` | Double |
| `Boolean IsMirrored { get; }` | `structuralElementDefinitionData.IsMirrored` | Boolean |
| `Boolean IsValidObject { get; }` | `structuralElementDefinitionData.IsValidObject` | Boolean |
| `XYZ Normal { get; }` | `structuralElementDefinitionData.Normal` | XYZ |
| `StructuralSection Section { get; }` | `structuralElementDefinitionData.Section` | StructuralSection |
| `Double StartShortening { get; }` | `structuralElementDefinitionData.StartShortening` | Double |
| `YJustification YJust { get; }` | `structuralElementDefinitionData.YJust` | YJustification |
| `Double YOffset { get; }` | `structuralElementDefinitionData.YOffset` | Double |
| `ZJustification ZJust { get; }` | `structuralElementDefinitionData.ZJust` | ZJustification |
| `Double ZOffset { get; }` | `structuralElementDefinitionData.ZOffset` | Double |
| `Void Dispose()` | `structuralElementDefinitionData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```